newwms_gift/src/DataProcessors/ит_WMS_КонструкторФормированияЯчеек/ит_WMS_КонструкторФормированияЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ит_WMS_КонструкторФормированияЯчеек</name>
  <attributes>
    <name>СкладскоеПомещение</name>
    <type>
      <types>CatalogRef.итСкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтеллажС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтеллажПО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯрусС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯрусПО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкладскойДеятельности</name>
    <type>
      <types>EnumRef.ит_WMS_ВидыСкладскойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Зона</name>
    <type>
      <types>EnumRef.итWMSЗоныСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьШК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЯчейкиКОбработке</name>
    <attributes>
      <name>ЛинияС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтеллажС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтеллажПО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯрусС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯрусПО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладскоеПомещение</name>
      <type>
        <types>CatalogRef.итСкладскиеПомещения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПорядокСкладскихПомещение</name>
    <attributes>
      <name>СкладскоеПомещение</name>
      <type>
        <types>CatalogRef.итСкладскиеПомещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

newwms_gift/src/InformationRegisters/ИтWMSШтрихКоды/ИтWMSШтрихКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИтWMSШтрихКоды</name>
  <resources>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.итWMSОборудование</types>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Catalogs/итСкладскиеЯчейки/итСкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>итСкладскиеЯчейки</name>
  <comment>Используется при адресном хранении на складском помещении.</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПустаяЯчейка</name>
      <description>Пустая ячейка</description>
    </items>
  </predefined>
  <attributes>
    <name>СкладскоеПомещение</name>
    <type>
      <types>CatalogRef.итСкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ярус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОбхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.итТипоразмерыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заблокирована</name>
    <comment>Используется для временной блокировки ячеек. Заблок.яч. перестает попадать в автоматическую и ручную раздачу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зона</name>
    <type>
      <types>EnumRef.итWMSЗоныСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРяда_Пролета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаНачалаРазмещения</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияБлокировкиИнвентаризации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкладскойДеятельности</name>
    <type>
      <types>EnumRef.ит_WMS_ВидыСкладскойДеятельности</types>
    </type>
  </attributes>
</mdclass:Catalog>

newwms_gift/src/DataProcessors/ит_WMS_КонструкторФормированияЯчеек/Forms/Форма/Module.bsl
#Область СозданиеЯчеек
&НаСервере
Процедура СоздатьНаСервере()
	РодительСкладскогоПомещения=НайтиСоздатьРодительСкладскогоПомещения();
	СтруктураПараметров=новый Структура;
	СтруктураПараметров.Вставить("Линия",0);
	СтруктураПараметров.Вставить("Стеллаж",0);
	СтруктураПараметров.Вставить("Ярус",0);
	Для n=Объект.ЛинияС по Объект.ЛинияПо Цикл 
		РодительЛинии=НайтиСоздатьРодительЛинии(n,РодительСкладскогоПомещения);
		СтруктураПараметров.Линия=n;
		СоздатьНаСервереСтелаж(РодительЛинии,СтруктураПараметров);
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура СоздатьНаСервереСтелаж(РодительЛинии,СтруктураПараметров)
	Для n=Объект.СтеллажС по Объект.СтеллажПО Цикл 
		РодительСтеллажа=НайтиСоздатьРодительСтеллажа(n,РодительЛинии);
		СтруктураПараметров.Стеллаж=n;
		СоздатьНаСервереЯрус(РодительСтеллажа,СтруктураПараметров);
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура СоздатьНаСервереЯрус(РодительСтелажа,СтруктураПараметров)	
	Для n=Объект.ЯрусС по Объект.ЯрусПО Цикл 
		СтруктураПараметров.Ярус=n;	
		ПоискСозданияЭлемента(СтруктураПараметров,РодительСтелажа)
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура Создать(Команда)
	Если Объект.ЛинияС=0 Тогда 
		Возврат
	КонецЕсли;	
	Если Объект.ЛинияПо=0 Тогда 
		Возврат
	КонецЕсли;	
	Если Объект.СтеллажС=0 Тогда 
		Возврат
	КонецЕсли;	
	Если Объект.СтеллажПО=0 Тогда 
		Возврат
	КонецЕсли;
	Если Объект.ЯрусС=0 Тогда 
		Возврат
	КонецЕсли;
	Если Объект.ЯрусПО=0 Тогда 
		Возврат
	КонецЕсли;
	Если Объект.СкладскоеПомещение.Пустая() Тогда 
		Возврат
	КонецЕсли;	
	Оповещение=новый ОписаниеОповещения("СоздатьОповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Вы уверены, что хотите создать новые ячейки?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
&НаКлиенте
Процедура СоздатьОповещение(Результат,Параметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Нет Тогда 
		Возврат
	КонецЕсли;	
	СоздатьНаСервере();
КонецПроцедуры
&НаСервере
Функция НайтиСоздатьРодительСкладскогоПомещения()
	НаименованиеРодителя="Зона "+Объект.СкладскоеПомещение.Префикс;
	Возврат  ПоискСозданиеРодителя(НаименованиеРодителя);
КонецФункции
&НаСервере
Функция НайтиСоздатьРодительЛинии(НомерЛинии,Родитель)
	НаименованиеРодителя=Объект.СкладскоеПомещение.Префикс+"-"+ДобавитьНули(НомерЛинии);
	Возврат  ПоискСозданиеРодителя(НаименованиеРодителя,Родитель);
КонецФункции
&НаСервере
Функция НайтиСоздатьРодительСтеллажа(НомерСтеллажа,Родитель)
	НаименованиеРодителя=Родитель.Наименование+"-"+ДобавитьНули(НомерСтеллажа);
	Возврат  ПоискСозданиеРодителя(НаименованиеРодителя,Родитель);
КонецФункции
&НаСервере
Функция ПоискСозданиеРодителя(НаименованиеРодителя,Родитель=Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итСкладскиеЯчейки.Ссылка
	|ИЗ
	|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
	|ГДЕ
	|	итСкладскиеЯчейки.Наименование = &Наименование
	|	И итСкладскиеЯчейки.СкладскоеПомещение = &СкладскоеПомещение
	|	И ВЫБОР
	|			КОГДА &Родитель = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ итСкладскиеЯчейки.Родитель = &Родитель
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеРодителя);
	Запрос.УстановитьПараметр("СкладскоеПомещение", Объект.СкладскоеПомещение);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	НовыйГрупповойЭлемент=Справочники.итСкладскиеЯчейки.СоздатьГруппу();
	НовыйГрупповойЭлемент.Наименование=НаименованиеРодителя;
	Если Родитель<>Неопределено  Тогда 
		НовыйГрупповойЭлемент.Родитель=Родитель;
	КонецЕсли;
	НовыйГрупповойЭлемент.СкладскоеПомещение=Объект.СкладскоеПомещение;
	НовыйГрупповойЭлемент.Записать();
	Возврат НовыйГрупповойЭлемент.Ссылка;
	
КонецФункции
&НаСервере
Процедура ПоискСозданияЭлемента(СтруктураПараметров,Родитель)
	Линия=ДобавитьНули(СтруктураПараметров.Линия);
	Стеллаж=ДобавитьНули(СтруктураПараметров.Стеллаж);
	Ярус=ДобавитьНули(СтруктураПараметров.Ярус,1);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итСкладскиеЯчейки.Ссылка
	|ИЗ
	|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
	|ГДЕ
	|	итСкладскиеЯчейки.СкладскоеПомещение = &СкладскоеПомещение
	|	И итСкладскиеЯчейки.Линия = &Линия
	|	И итСкладскиеЯчейки.Стеллаж = &Стеллаж
	|	И итСкладскиеЯчейки.Ярус = &Ярус";
	
	Запрос.УстановитьПараметр("Линия", Линия);
	Запрос.УстановитьПараметр("СкладскоеПомещение", Объект.СкладскоеПомещение);
	Запрос.УстановитьПараметр("Стеллаж", Стеллаж);
	Запрос.УстановитьПараметр("Ярус", Ярус);
	
	РезультатЗапроса = Запрос.Выполнить();
	СсылкаНаЭлемент=Неопределено;
	Если  РезультатЗапроса.Пустой() Тогда 
		НовыйЭлемент=Справочники.итСкладскиеЯчейки.СоздатьЭлемент();
		НовыйЭлемент.Наименование=Объект.СкладскоеПомещение.Префикс+"-"+Линия+"-"+Стеллаж+"-"+Ярус;
		НовыйЭлемент.Линия=Линия;
		НовыйЭлемент.Стеллаж=Стеллаж;
		НовыйЭлемент.Ярус=ярус;
		НовыйЭлемент.Родитель=Родитель;
		НовыйЭлемент.СкладскоеПомещение=Объект.СкладскоеПомещение;
		НовыйЭлемент.Зона=Объект.Зона;
		НовыйЭлемент.ВидСкладскойДеятельности=Объект.ВидСкладскойДеятельности;
		НовыйЭлемент.Записать();
		СсылкаНаЭлемент=НовыйЭлемент.Ссылка;
	иначе
		Выборка=РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда 
			СсылкаНаЭлемент=Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;	
	Если Объект.ФормироватьШК Тогда 
		НаборЗаписей=РегистрыСведений.ИтWMSШтрихКоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(СсылкаНаЭлемент);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.Объект=СсылкаНаЭлемент;
		НоваяЗапись.ШтрихКод=СсылкаНаЭлемент.Наименование;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	
КонецПроцедуры
#КонецОбласти

#Область УстановкаСнятиеБлокировки

&НаСервере	
Процедура ОбходЭлементовПоТаблице(ПараметрыФункций)
	ПараметрыФункций.Вставить("Линия",0);
	ПараметрыФункций.Вставить("Стеллаж",0);
	ПараметрыФункций.Вставить("Ярус",0);
	Для Каждого стр из Объект.ЯчейкиКОбработке Цикл
		ОбходПоЛиниям(ПараметрыФункций,стр);	
	КонецЦикла;
КонецПроцедуры
&НаСервере	
Процедура ОбходПоЛиниям(ПараметрыФункций,стр)
	Для n=стр.ЛинияС по стр.ЛинияПо Цикл 
		ПараметрыФункций.Линия=n;
		ОбходПоСтелажам(ПараметрыФункций,стр);
	КонецЦикла;
КонецПроцедуры
&НаСервере	
Процедура ОбходПоСтелажам(ПараметрыФункций,стр)
	Для n=стр.СтеллажС по стр.СтеллажПО Цикл 
		ПараметрыФункций.Стеллаж=n;
		ОбходПоЯрусам(ПараметрыФункций,стр);
	КонецЦикла;
КонецПроцедуры
&НаСервере	
Процедура ОбходПоЯрусам(ПараметрыФункций,стр)
	Для n=стр.ЯрусС по стр.ЯрусПО Цикл 
		ПараметрыФункций.Ярус=n;	
		ИзменениеЭлементов(ПараметрыФункций,стр)
	КонецЦикла;
КонецПроцедуры
&НаСервере	
Процедура ИзменениеЭлементов(ПараметрыФункций,стр)
	Линия=ДобавитьНули(ПараметрыФункций.Линия);
	Стеллаж=ДобавитьНули(ПараметрыФункций.Стеллаж);
	Ярус=ДобавитьНули(ПараметрыФункций.Ярус,1);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итСкладскиеЯчейки.Ссылка
	|ИЗ
	|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
	|ГДЕ
	|	итСкладскиеЯчейки.СкладскоеПомещение = &СкладскоеПомещение
	|	И итСкладскиеЯчейки.Линия = &Линия
	|	И итСкладскиеЯчейки.Стеллаж = &Стеллаж
	|	И итСкладскиеЯчейки.Ярус = &Ярус";
	
	Запрос.УстановитьПараметр("Линия", Линия);
	Запрос.УстановитьПараметр("СкладскоеПомещение", стр.СкладскоеПомещение);
	Запрос.УстановитьПараметр("Стеллаж", Стеллаж);
	Запрос.УстановитьПараметр("Ярус", Ярус);
	
	РезультатЗапроса=Запрос.Выполнить();
	
	Выборка=РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ОбъектКИзменению=Выборка.Ссылка.ПолучитьОбъект();
		Если ПараметрыФункций.Свойство("Блокировка") Тогда 
			Если ПараметрыФункций.Блокировка Тогда
				ОбъектКИзменению.Заблокирована=Истина;
			иначе
				ОбъектКИзменению.Заблокирована=Ложь;
			КонецЕсли;
		КонецЕсли;	
		Если ПараметрыФункций.Свойство("УстановкаРядаПролета") Тогда 
			Если ПараметрыФункций.УстановкаРядаПролета Тогда
				ОбъектКИзменению.НомерРяда_Пролета=НомерРяда;
			КонецЕсли;
		КонецЕсли;	
 
		Если Комментарий="*" Тогда 
			ОбъектКИзменению.Комментарий="";
		ИначеЕсли Комментарий="-" Тогда
			ОбъектКИзменению.Комментарий=ОбъектКИзменению.Комментарий;
		Иначе 
			ОбъектКИзменению.Комментарий=Комментарий;
		КонецЕсли;
		ОбъектКИзменению.Записать();
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура Заблокировать(Команда)
	Оповещение=новый ОписаниеОповещения("ЗаблокироватьОповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Вы точно хотите заблокировать выбранные ячейки",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьОповещение(Результат,Параметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Нет Тогда 
		Возврат
	КонецЕсли;
	ПараметрыФункций=новый Структура;
	ПараметрыФункций.Вставить("Блокировка",Истина);
	ОбходЭлементовПоТаблице(ПараметрыФункций);

КонецПроцедуры
&НаКлиенте
Процедура СнятьБлокировку(Команда)
	Оповещение=новый ОписаниеОповещения("СнятьБлокировкуОповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Вы точно хотите разблокировать выбранные ячейки",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура СнятьБлокировкуОповещение(Результат,Параметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Нет Тогда 
		Возврат
	КонецЕсли;
	ПараметрыФункций=новый Структура;
	ПараметрыФункций.Вставить("Блокировка",Ложь);
	ОбходЭлементовПоТаблице(ПараметрыФункций);
	КонецПроцедуры

&НаКлиенте
Процедура УстановитьНомерРядаПролета(Команда)
	Оповещение=новый ОписаниеОповещения("УстановитьНомерРядаПролетаОповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Вы точно хотите установить номер ряда",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
&НаКлиенте
Процедура УстановитьНомерРядаПролетаОповещение(Результат,Параметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Нет Тогда 
		Возврат
	КонецЕсли;
	ПараметрыФункций=новый Структура;
	ПараметрыФункций.Вставить("УстановкаРядаПролета",Истина);
	ОбходЭлементовПоТаблице(ПараметрыФункций);

КонецПроцедуры

#КонецОбласти
&НаСервере	
Функция ДобавитьНули(Значение,ДлинаСтроки=2)
	СтроковоеЗначение=Строка(Значение);
	ДлинаТекущейСтроки=СтрДлина(СтроковоеЗначение);
	КоличествоКДобавлению=ДлинаСтроки-ДлинаТекущейСтроки;
	Если КоличествоКДобавлению>0 Тогда 
		Для n=1 по КоличествоКДобавлению Цикл
			СтроковоеЗначение="0"+СтроковоеЗначение;
		КонецЦикла;
	КонецЕсли;
	Возврат СтроковоеЗначение;
КонецФункции

&НаСервере
Процедура ПереопределеитьПорядокОбходаНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорядокСкладскихПомещений.НомерСтроки,
		|	ПорядокСкладскихПомещений.СкладскоеПомещение
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ПорядокСкладскихПомещений КАК ПорядокСкладскихПомещений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТ.НомерСтроки) КАК НомерСтроки,
		|	ВТ.СкладскоеПомещение
		|ПОМЕСТИТЬ ВтГруппировка
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.СкладскоеПомещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итСкладскиеЯчейки.Ссылка,
		|	итСкладскиеЯчейки.СкладскоеПомещение,
		|	итСкладскиеЯчейки.НомерРяда_Пролета,
		|	ВЫБОР
		|		КОГДА итСкладскиеЯчейки.Линия = ""1""
		|			ТОГДА 1
		|		КОГДА итСкладскиеЯчейки.Линия = ""01""
		|			ТОГДА 1
		|		КОГДА итСкладскиеЯчейки.Линия = ""2""
		|			ТОГДА 2
		|		КОГДА итСкладскиеЯчейки.Линия = ""02""
		|			ТОГДА 2
		|		КОГДА итСкладскиеЯчейки.Линия = ""3""
		|			ТОГДА 3
		|		КОГДА итСкладскиеЯчейки.Линия = ""03""
		|			ТОГДА 3
		|		КОГДА итСкладскиеЯчейки.Линия = ""4""
		|			ТОГДА 4
		|		КОГДА итСкладскиеЯчейки.Линия = ""04""
		|			ТОГДА 4
		|		КОГДА итСкладскиеЯчейки.Линия = ""5""
		|			ТОГДА 5
		|		КОГДА итСкладскиеЯчейки.Линия = ""05""
		|			ТОГДА 5
		|		КОГДА итСкладскиеЯчейки.Линия = ""6""
		|			ТОГДА 6
		|		КОГДА итСкладскиеЯчейки.Линия = ""06""
		|			ТОГДА 6
		|		КОГДА итСкладскиеЯчейки.Линия = ""7""
		|			ТОГДА 7
		|		КОГДА итСкладскиеЯчейки.Линия = ""07""
		|			ТОГДА 7
		|		КОГДА итСкладскиеЯчейки.Линия = ""8""
		|			ТОГДА 8
		|		КОГДА итСкладскиеЯчейки.Линия = ""08""
		|			ТОГДА 8
		|		КОГДА итСкладскиеЯчейки.Линия = ""9""
		|			ТОГДА 9
		|		КОГДА итСкладскиеЯчейки.Линия = ""09""
		|			ТОГДА 9
		|		КОГДА итСкладскиеЯчейки.Линия = ""10""
		|			ТОГДА 10
		|		КОГДА итСкладскиеЯчейки.Линия = ""010""
		|			ТОГДА 10
		|		КОГДА итСкладскиеЯчейки.Линия = ""11""
		|			ТОГДА 11
		|		КОГДА итСкладскиеЯчейки.Линия = ""011""
		|			ТОГДА 11
		|		КОГДА итСкладскиеЯчейки.Линия = ""12""
		|			ТОГДА 12
		|		КОГДА итСкладскиеЯчейки.Линия = ""012""
		|			ТОГДА 12
		|		КОГДА итСкладскиеЯчейки.Линия = ""13""
		|			ТОГДА 13
		|		КОГДА итСкладскиеЯчейки.Линия = ""013""
		|			ТОГДА 13
		|		КОГДА итСкладскиеЯчейки.Линия = ""14""
		|			ТОГДА 14
		|		КОГДА итСкладскиеЯчейки.Линия = ""014""
		|			ТОГДА 14
		|		КОГДА итСкладскиеЯчейки.Линия = ""15""
		|			ТОГДА 15
		|		КОГДА итСкладскиеЯчейки.Линия = ""015""
		|			ТОГДА 15
		|		КОГДА итСкладскиеЯчейки.Линия = ""16""
		|			ТОГДА 16
		|		КОГДА итСкладскиеЯчейки.Линия = ""016""
		|			ТОГДА 16
		|		КОГДА итСкладскиеЯчейки.Линия = ""17""
		|			ТОГДА 17
		|		КОГДА итСкладскиеЯчейки.Линия = ""017""
		|			ТОГДА 17
		|		КОГДА итСкладскиеЯчейки.Линия = ""18""
		|			ТОГДА 18
		|		КОГДА итСкладскиеЯчейки.Линия = ""018""
		|			ТОГДА 18
		|		КОГДА итСкладскиеЯчейки.Линия = ""19""
		|			ТОГДА 19
		|		КОГДА итСкладскиеЯчейки.Линия = ""019""
		|			ТОГДА 19
		|		КОГДА итСкладскиеЯчейки.Линия = ""20""
		|			ТОГДА 20
		|		КОГДА итСкладскиеЯчейки.Линия = ""020""
		|			ТОГДА 20
		|		КОГДА итСкладскиеЯчейки.Линия = ""21""
		|			ТОГДА 21
		|		КОГДА итСкладскиеЯчейки.Линия = ""021""
		|			ТОГДА 21
		|		КОГДА итСкладскиеЯчейки.Линия = ""22""
		|			ТОГДА 22
		|		КОГДА итСкладскиеЯчейки.Линия = ""022""
		|			ТОГДА 22
		|		КОГДА итСкладскиеЯчейки.Линия = ""23""
		|			ТОГДА 23
		|		КОГДА итСкладскиеЯчейки.Линия = ""023""
		|			ТОГДА 23
		|		КОГДА итСкладскиеЯчейки.Линия = ""24""
		|			ТОГДА 24
		|		КОГДА итСкладскиеЯчейки.Линия = ""024""
		|			ТОГДА 24
		|		КОГДА итСкладскиеЯчейки.Линия = ""25""
		|			ТОГДА 25
		|		КОГДА итСкладскиеЯчейки.Линия = ""025""
		|			ТОГДА 25
		|		КОГДА итСкладскиеЯчейки.Линия = ""26""
		|			ТОГДА 26
		|		КОГДА итСкладскиеЯчейки.Линия = ""026""
		|			ТОГДА 26
		|		КОГДА итСкладскиеЯчейки.Линия = ""27""
		|			ТОГДА 27
		|		КОГДА итСкладскиеЯчейки.Линия = ""027""
		|			ТОГДА 27
		|		КОГДА итСкладскиеЯчейки.Линия = ""28""
		|			ТОГДА 28
		|		КОГДА итСкладскиеЯчейки.Линия = ""028""
		|			ТОГДА 28
		|		КОГДА итСкладскиеЯчейки.Линия = ""29""
		|			ТОГДА 29
		|		КОГДА итСкладскиеЯчейки.Линия = ""029""
		|			ТОГДА 29
		|		КОГДА итСкладскиеЯчейки.Линия = ""30""
		|			ТОГДА 30
		|		КОГДА итСкладскиеЯчейки.Линия = ""030""
		|			ТОГДА 30
		|		КОГДА итСкладскиеЯчейки.Линия = ""31""
		|			ТОГДА 31
		|		КОГДА итСкладскиеЯчейки.Линия = ""031""
		|			ТОГДА 31
		|		КОГДА итСкладскиеЯчейки.Линия = ""32""
		|			ТОГДА 32
		|		КОГДА итСкладскиеЯчейки.Линия = ""032""
		|			ТОГДА 32
		|		КОГДА итСкладскиеЯчейки.Линия = ""33""
		|			ТОГДА 33
		|		КОГДА итСкладскиеЯчейки.Линия = ""033""
		|			ТОГДА 33
		|		КОГДА итСкладскиеЯчейки.Линия = ""34""
		|			ТОГДА 34
		|		КОГДА итСкладскиеЯчейки.Линия = ""034""
		|			ТОГДА 34
		|		КОГДА итСкладскиеЯчейки.Линия = ""35""
		|			ТОГДА 35
		|		КОГДА итСкладскиеЯчейки.Линия = ""035""
		|			ТОГДА 35
		|		КОГДА итСкладскиеЯчейки.Линия = ""36""
		|			ТОГДА 36
		|		КОГДА итСкладскиеЯчейки.Линия = ""036""
		|			ТОГДА 36
		|		КОГДА итСкладскиеЯчейки.Линия = ""37""
		|			ТОГДА 37
		|		КОГДА итСкладскиеЯчейки.Линия = ""037""
		|			ТОГДА 37
		|		КОГДА итСкладскиеЯчейки.Линия = ""38""
		|			ТОГДА 38
		|		КОГДА итСкладскиеЯчейки.Линия = ""038""
		|			ТОГДА 38
		|		КОГДА итСкладскиеЯчейки.Линия = ""39""
		|			ТОГДА 39
		|		КОГДА итСкладскиеЯчейки.Линия = ""039""
		|			ТОГДА 39
		|		КОГДА итСкладскиеЯчейки.Линия = ""40""
		|			ТОГДА 40
		|		КОГДА итСкладскиеЯчейки.Линия = ""040""
		|			ТОГДА 40
		|		КОГДА итСкладскиеЯчейки.Линия = ""41""
		|			ТОГДА 41
		|		КОГДА итСкладскиеЯчейки.Линия = ""041""
		|			ТОГДА 41
		|		КОГДА итСкладскиеЯчейки.Линия = ""42""
		|			ТОГДА 42
		|		КОГДА итСкладскиеЯчейки.Линия = ""042""
		|			ТОГДА 42
		|		КОГДА итСкладскиеЯчейки.Линия = ""43""
		|			ТОГДА 43
		|		КОГДА итСкладскиеЯчейки.Линия = ""043""
		|			ТОГДА 43
		|		КОГДА итСкладскиеЯчейки.Линия = ""44""
		|			ТОГДА 44
		|		КОГДА итСкладскиеЯчейки.Линия = ""044""
		|			ТОГДА 44
		|		КОГДА итСкладскиеЯчейки.Линия = ""45""
		|			ТОГДА 45
		|		КОГДА итСкладскиеЯчейки.Линия = ""045""
		|			ТОГДА 45
		|		КОГДА итСкладскиеЯчейки.Линия = ""46""
		|			ТОГДА 46
		|		КОГДА итСкладскиеЯчейки.Линия = ""046""
		|			ТОГДА 46
		|		КОГДА итСкладскиеЯчейки.Линия = ""47""
		|			ТОГДА 47
		|		КОГДА итСкладскиеЯчейки.Линия = ""047""
		|			ТОГДА 47
		|		КОГДА итСкладскиеЯчейки.Линия = ""48""
		|			ТОГДА 48
		|		КОГДА итСкладскиеЯчейки.Линия = ""048""
		|			ТОГДА 48
		|		КОГДА итСкладскиеЯчейки.Линия = ""49""
		|			ТОГДА 49
		|		КОГДА итСкладскиеЯчейки.Линия = ""049""
		|			ТОГДА 49
		|		КОГДА итСкладскиеЯчейки.Линия = ""50""
		|			ТОГДА 50
		|		КОГДА итСкладскиеЯчейки.Линия = ""050""
		|			ТОГДА 50
		|	КОНЕЦ КАК Линия,
		|	ВЫБОР
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""1""
		|			ТОГДА 1
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""01""
		|			ТОГДА 1
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""2""
		|			ТОГДА 2
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""02""
		|			ТОГДА 2
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""3""
		|			ТОГДА 3
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""03""
		|			ТОГДА 3
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""4""
		|			ТОГДА 4
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""04""
		|			ТОГДА 4
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""5""
		|			ТОГДА 5
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""05""
		|			ТОГДА 5
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""6""
		|			ТОГДА 6
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""06""
		|			ТОГДА 6
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""7""
		|			ТОГДА 7
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""07""
		|			ТОГДА 7
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""8""
		|			ТОГДА 8
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""08""
		|			ТОГДА 8
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""9""
		|			ТОГДА 9
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""09""
		|			ТОГДА 9
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""10""
		|			ТОГДА 10
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""010""
		|			ТОГДА 10
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""11""
		|			ТОГДА 11
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""011""
		|			ТОГДА 11
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""12""
		|			ТОГДА 12
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""012""
		|			ТОГДА 12
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""13""
		|			ТОГДА 13
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""013""
		|			ТОГДА 13
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""14""
		|			ТОГДА 14
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""014""
		|			ТОГДА 14
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""15""
		|			ТОГДА 15
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""015""
		|			ТОГДА 15
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""16""
		|			ТОГДА 16
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""016""
		|			ТОГДА 16
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""17""
		|			ТОГДА 17
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""017""
		|			ТОГДА 17
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""18""
		|			ТОГДА 18
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""018""
		|			ТОГДА 18
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""19""
		|			ТОГДА 19
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""019""
		|			ТОГДА 19
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""20""
		|			ТОГДА 20
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""020""
		|			ТОГДА 20
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""21""
		|			ТОГДА 21
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""021""
		|			ТОГДА 21
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""22""
		|			ТОГДА 22
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""022""
		|			ТОГДА 22
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""23""
		|			ТОГДА 23
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""023""
		|			ТОГДА 23
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""24""
		|			ТОГДА 24
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""024""
		|			ТОГДА 24
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""25""
		|			ТОГДА 25
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""025""
		|			ТОГДА 25
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""26""
		|			ТОГДА 26
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""026""
		|			ТОГДА 26
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""27""
		|			ТОГДА 27
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""027""
		|			ТОГДА 27
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""28""
		|			ТОГДА 28
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""028""
		|			ТОГДА 28
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""29""
		|			ТОГДА 29
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""029""
		|			ТОГДА 29
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""30""
		|			ТОГДА 30
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""030""
		|			ТОГДА 30
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""31""
		|			ТОГДА 31
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""031""
		|			ТОГДА 31
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""32""
		|			ТОГДА 32
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""032""
		|			ТОГДА 32
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""33""
		|			ТОГДА 33
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""033""
		|			ТОГДА 33
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""34""
		|			ТОГДА 34
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""034""
		|			ТОГДА 34
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""35""
		|			ТОГДА 35
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""035""
		|			ТОГДА 35
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""36""
		|			ТОГДА 36
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""036""
		|			ТОГДА 36
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""37""
		|			ТОГДА 37
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""037""
		|			ТОГДА 37
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""38""
		|			ТОГДА 38
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""038""
		|			ТОГДА 38
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""39""              
		|			ТОГДА 39
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""039""
		|			ТОГДА 39
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""40""
		|			ТОГДА 40
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""040""
		|			ТОГДА 40
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""41""
		|			ТОГДА 41
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""041""
		|			ТОГДА 41
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""42""
		|			ТОГДА 42
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""042""
		|			ТОГДА 42
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""43""
		|			ТОГДА 43
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""043""
		|			ТОГДА 43
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""44""
		|			ТОГДА 44
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""044""
		|			ТОГДА 44
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""45""
		|			ТОГДА 45
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""045""
		|			ТОГДА 45
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""46""
		|			ТОГДА 46
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""046""
		|			ТОГДА 46
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""47""
		|			ТОГДА 47
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""047""
		|			ТОГДА 47
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""48""
		|			ТОГДА 48
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""048""
		|			ТОГДА 48
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""49""
		|			ТОГДА 49
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""049""
		|			ТОГДА 49
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""50""
		|			ТОГДА 50
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""050""
		|			ТОГДА 50
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""51""
		|			ТОГДА 51
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""051""
		|			ТОГДА 51
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""52""
		|			ТОГДА 52
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""052""
		|			ТОГДА 52
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""53""
		|			ТОГДА 53
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""053""
		|			ТОГДА 53
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""54""
		|			ТОГДА 54
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""054""
		|			ТОГДА 54
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""55""
		|			ТОГДА 55
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""055""
		|			ТОГДА 55
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""56""
		|			ТОГДА 56
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""056""
		|			ТОГДА 56
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""57""
		|			ТОГДА 57
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""057""
		|			ТОГДА 57
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""58""
		|			ТОГДА 58
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""058""
		|			ТОГДА 58
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""59""
		|			ТОГДА 59
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""059""
		|			ТОГДА 59
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""60""
		|			ТОГДА 60
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""060""
		|			ТОГДА 60
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""61""
		|			ТОГДА 61
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""061""
		|			ТОГДА 61
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""62""
		|			ТОГДА 62
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""062""
		|			ТОГДА 62
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""63""
		|			ТОГДА 63
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""063""
		|			ТОГДА 63
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""64""
		|			ТОГДА 64
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""064""
		|			ТОГДА 64
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""65""
		|			ТОГДА 65
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""065""
		|			ТОГДА 65
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""66""
		|			ТОГДА 66
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""066""
		|			ТОГДА 66
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""67""
		|			ТОГДА 67
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""067""
		|			ТОГДА 67
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""68""
		|			ТОГДА 68
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""068""
		|			ТОГДА 68
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""69""
		|			ТОГДА 69
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""069""
		|			ТОГДА 69
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""70""
		|			ТОГДА 70
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""070""
		|			ТОГДА 70
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""71""
		|			ТОГДА 71
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""071""
		|			ТОГДА 71
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""72""
		|			ТОГДА 72
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""072""
		|			ТОГДА 72
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""73""
		|			ТОГДА 73
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""073""
		|			ТОГДА 73
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""74""
		|			ТОГДА 74
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""074""
		|			ТОГДА 74
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""75""
		|			ТОГДА 75
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""075""
		|			ТОГДА 75
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""76""
		|			ТОГДА 76
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""076""
		|			ТОГДА 76
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""77""
		|			ТОГДА 77
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""077""
		|			ТОГДА 77
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""78""
		|			ТОГДА 78
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""078""
		|			ТОГДА 78
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""79""
		|			ТОГДА 79
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""079""
		|			ТОГДА 79
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""80""
		|			ТОГДА 80
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""080""
		|			ТОГДА 80
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""81""
		|			ТОГДА 81
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""081""
		|			ТОГДА 81
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""82""
		|			ТОГДА 82
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""082""
		|			ТОГДА 82
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""83""
		|			ТОГДА 83
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""083""
		|			ТОГДА 83
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""84""
		|			ТОГДА 84
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""084""
		|			ТОГДА 84
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""85""
		|			ТОГДА 85
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""085""
		|			ТОГДА 85
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""86""
		|			ТОГДА 86
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""086""
		|			ТОГДА 86
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""87""
		|			ТОГДА 87
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""087""
		|			ТОГДА 87
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""88""
		|			ТОГДА 88
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""088""
		|			ТОГДА 88
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""89""
		|			ТОГДА 89
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""089""
		|			ТОГДА 89
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""90""
		|			ТОГДА 90
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""090""
		|			ТОГДА 90
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""91""
		|			ТОГДА 91
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""091""
		|			ТОГДА 91
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""92""
		|			ТОГДА 92
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""092""
		|			ТОГДА 92
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""93""
		|			ТОГДА 93
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""093""
		|			ТОГДА 93
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""94""
		|			ТОГДА 94
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""094""
		|			ТОГДА 94
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""95""
		|			ТОГДА 95
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""095""
		|			ТОГДА 95
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""96""
		|			ТОГДА 96
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""096""
		|			ТОГДА 96
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""97""
		|			ТОГДА 97
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""097""
		|			ТОГДА 97
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""98""
		|			ТОГДА 98
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""098""
		|			ТОГДА 98
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""99""
		|			ТОГДА 99
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""099""
		|			ТОГДА 99
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""100""
		|			ТОГДА 100
		|		КОГДА итСкладскиеЯчейки.Стеллаж = ""0100""
		|			ТОГДА 100
		|	КОНЕЦ КАК Стеллаж,
		|	ВЫБОР
		|		КОГДА итСкладскиеЯчейки.Ярус = ""1""
		|			ТОГДА 1
		|		КОГДА итСкладскиеЯчейки.Ярус = ""01""
		|			ТОГДА 1
		|		КОГДА итСкладскиеЯчейки.Ярус = ""2""
		|			ТОГДА 2
		|		КОГДА итСкладскиеЯчейки.Ярус = ""02""
		|			ТОГДА 2
		|		КОГДА итСкладскиеЯчейки.Ярус = ""3""
		|			ТОГДА 3
		|		КОГДА итСкладскиеЯчейки.Ярус = ""03""
		|			ТОГДА 3
		|		КОГДА итСкладскиеЯчейки.Ярус = ""4""
		|			ТОГДА 4
		|		КОГДА итСкладскиеЯчейки.Ярус = ""04""
		|			ТОГДА 4
		|		КОГДА итСкладскиеЯчейки.Ярус = ""5""
		|			ТОГДА 5
		|		КОГДА итСкладскиеЯчейки.Ярус = ""05""
		|			ТОГДА 5
		|		КОГДА итСкладскиеЯчейки.Ярус = ""6""
		|			ТОГДА 6
		|		КОГДА итСкладскиеЯчейки.Ярус = ""06""
		|			ТОГДА 6
		|		КОГДА итСкладскиеЯчейки.Ярус = ""7""
		|			ТОГДА 7
		|		КОГДА итСкладскиеЯчейки.Ярус = ""07""
		|			ТОГДА 7
		|		КОГДА итСкладскиеЯчейки.Ярус = ""8""
		|			ТОГДА 8
		|		КОГДА итСкладскиеЯчейки.Ярус = ""08""
		|			ТОГДА 8
		|		КОГДА итСкладскиеЯчейки.Ярус = ""9""
		|			ТОГДА 9
		|		КОГДА итСкладскиеЯчейки.Ярус = ""09""
		|			ТОГДА 9
		|		КОГДА итСкладскиеЯчейки.Ярус = ""10""
		|			ТОГДА 10
		|		КОГДА итСкладскиеЯчейки.Ярус = ""010""
		|			ТОГДА 10
		|	КОНЕЦ КАК Ярус
		|ПОМЕСТИТЬ ВтДанныеЯчеек
		|ИЗ
		|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
		|ГДЕ
		|	итСкладскиеЯчейки.НомерРяда_Пролета > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтДанныеЯчеек.Ссылка,
		|	ВтДанныеЯчеек.СкладскоеПомещение КАК СкладскоеПомещение,
		|	ВтДанныеЯчеек.НомерРяда_Пролета КАК НомерРяда_Пролета,
		|	ВтДанныеЯчеек.Линия КАК Линия,
		|	ВтДанныеЯчеек.Стеллаж КАК Стеллаж,
		|	ВтДанныеЯчеек.Ярус КАК Ярус,
		|	ЕСТЬNULL(ВтГруппировка.НомерСтроки, 999999) КАК ПорядокСкладскогоПомещения
		|ИЗ
		|	ВтДанныеЯчеек КАК ВтДанныеЯчеек
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтГруппировка КАК ВтГруппировка
		|		ПО ВтДанныеЯчеек.СкладскоеПомещение = ВтГруппировка.СкладскоеПомещение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокСкладскогоПомещения,
		|	СкладскоеПомещение,
		|	НомерРяда_Пролета,
		|	Стеллаж,
		|	Ярус,
		|	Линия";
	
	Запрос.УстановитьПараметр("ПорядокСкладскихПомещений",Объект.ПорядокСкладскихПомещение.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ПорядокОбхода=10;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ОбъектИзменения=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	ОбъектИзменения.ПорядокОбхода=ПорядокОбхода;
	ОбъектИзменения.Записать();
	ПорядокОбхода=ПорядокОбхода+10;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПереопределеитьПорядокОбхода(Команда)
	Оповещение=новый ОписаниеОповещения("ПереопределеитьПорядокОбходаОповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Вы уверены, что хотите запустить процесс заполнения порядка обхода ячеек",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
&НаКлиенте
Процедура ПереопределеитьПорядокОбходаОповещение(Результат,Параметры) Экспорт 
	Если  Результат=КодВозвратаДиалога.Нет Тогда 
		Возврат
	КонецЕсли;
	ПереопределеитьПорядокОбходаНаСервере();
	КонецПроцедуры
